tylertms/dspic33e-sim/conformance/output_compare.c
static void trigger_source_negative_cases(OutputCompareConformance* state,
                                          Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_compare_mode(cpu, 15u, 6u, 4u, 2u, (uint16_t)(COMPARE_TRIGGER | 29u));
    dspic33_raise_interrupt(cpu, 20u);
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance after software INT1 flag set");
    expect(state,
           (dspic33_read_word(cpu, 0x0998u) & COMPARE_TRIGGER_STATUS) == 0u &&
               dspic33_read_word(cpu, 0x099eu) == 0u,
           "software interrupt flag does not synthesize external trigger edge");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0142u, 0u);
    dspic33_write_word(cpu, 0x0140u, 0x1c23u);
    configure_compare_mode(cpu, 15u, 6u, 4u, 2u, (uint16_t)(COMPARE_TRIGGER | 16u));
    expect(state,
           dspic33_input_capture_input(cpu, 0u, true, 0u) &&
               dspic33_device_advance(cpu, 3u),
           "capture without interrupt advances");
    expect(state, (dspic33_read_word(cpu, 0x0998u) & COMPARE_TRIGGER_STATUS) == 0u,
           "capture event without IC interrupt does not trigger OC");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0a84u, 0x8000u);
    configure_compare_mode(cpu, 15u, 6u, 4u, 2u, (uint16_t)(COMPARE_TRIGGER | 24u));
    expect(
        state,
        dspic33_comparator_input(cpu, 0u, DSPIC33_COMPARATOR_INPUT_POSITIVE, 1u, 0u) &&
            dspic33_device_advance(cpu, 0u),
        "comparator transition without event advances");
    expect(state, (dspic33_read_word(cpu, 0x0998u) & COMPARE_TRIGGER_STATUS) == 0u,
           "comparator output without compare event does not trigger OC");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0360u, 0x8000u);
    configure_compare_mode(cpu, 15u, 6u, 4u, 2u, (uint16_t)(COMPARE_TRIGGER | 27u));
    dspic33_write_word(cpu, 0x0360u, 0x8002u);
    dspic33_write_word(cpu, 0x0360u, 0x8000u);
    expect(state, dspic33_device_advance(cpu, 12u),
           "complete ADC2 conversion beside OC trigger");
    expect(state, (dspic33_read_word(cpu, 0x0998u) & COMPARE_TRIGGER_STATUS) == 0u,
           "ADC2 completion does not drive ADC1 trigger source");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, timer_periods[1], 1u);
    dspic33_write_word(cpu, timer_controls[1], 0x8000u);
    configure_compare_mode(cpu, 15u, 6u, 4u, 2u, (uint16_t)(COMPARE_TRIGGER | 11u));
    expect(state, dspic33_device_advance(cpu, 2u), "advance nonselected timer period");
    expect(state, (dspic33_read_word(cpu, 0x0998u) & COMPARE_TRIGGER_STATUS) == 0u,
           "Timer2 period does not drive Timer1 trigger selection");

    dspic33_reset(cpu, 0u);
    configure_compare_mode(cpu, 15u, 6u, 4u, 2u, (uint16_t)(COMPARE_TRIGGER | 30u));
    expect(state,
           dspic33_schedule(cpu, DSPIC33_EVENT_INTERRUPT, 21u, 0u, 1u) &&
               dspic33_device_advance(cpu, 1u),
           "raise unrelated interrupt beside INT2 trigger");
    expect(state, (dspic33_read_word(cpu, 0x0998u) & COMPARE_TRIGGER_STATUS) == 0u,
           "unrelated interrupt does not drive external trigger source");
}

static void coexistence_cases(OutputCompareConformance* state, Dspic33* cpu) {
    static const uint8_t collision_modes[] = {1u, 5u, 6u};
    uint16_t capture_base = 0x01b8u;
    size_t index;
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0142u, 0x00c0u);
    dspic33_write_word(cpu, 0x0140u, 0x1c03u);
    configure_compare(cpu, 0u, 4u, 2u);
    expect(state, dspic33_input_capture_input(cpu, 0u, true, 0u),
           "queue input capture beside OC");
    expect(state, dspic33_device_advance(cpu, 1u), "advance IC and OC together");
    expect(state,
           cpu->io.input_capture.fifo[0].count == 1u &&
               dspic33_read_word(cpu, 0x0144u) == 1u &&
               dspic33_read_word(cpu, 0x0908u) == 1u && output_is(cpu, 0u, true),
           "IC and OC advance independently");
    expect(state, dspic33_device_advance(cpu, 1u), "advance OC duty beside IC");
    expect(state,
           cpu->io.input_capture.fifo[0].count == 0u && output_is(cpu, 0u, false) &&
               dspic33_read_word(cpu, 0x0908u) == 2u,
           "IC read side effect does not disturb OC");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, capture_base, 0u);
    dspic33_write_word(cpu, (uint16_t)(capture_base + 2u), 0x0081u);
    dspic33_write_word(cpu, capture_base, 0x1c03u);
    configure_compare_mode(cpu, 0u, 6u, 4u, 2u, COMPARE_NO_SYNC);
    expect(state, dspic33_device_advance(cpu, 4u),
           "advance free-running OC to secondary compare");
    expect(state,
           dspic33_read_word(cpu, 0x0908u) == 4u &&
               (dspic33_read_word(cpu, (uint16_t)(capture_base + 2u)) & 0x0040u) == 0u,
           "free-running OC sync output waits one clock after secondary compare");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance free-running OC synchronization output");
    expect(state,
           dspic33_read_word(cpu, 0x0908u) == 5u &&
               (dspic33_read_word(cpu, (uint16_t)(capture_base + 2u)) & 0x0040u) != 0u,
           "free-running OC triggers downstream without resetting its timer");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance triggered capture timer after OC synchronization");
    expect(state,
           dspic33_read_word(cpu, (uint16_t)(capture_base + 6u)) == 1u &&
               dspic33_read_word(cpu, 0x0908u) == 6u,
           "OC synchronization starts the downstream timer on the next clock");

    for (index = 0u; index < sizeof(collision_modes) / sizeof(collision_modes[0]);
         index++) {
        uint8_t mode = collision_modes[index];
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, capture_base, 0u);
        dspic33_write_word(cpu, (uint16_t)(capture_base + 2u), 0x0081u);
        dspic33_write_word(cpu, capture_base, 0x1c03u);
        configure_compare_mode(cpu, 0u, mode, 4u, 5u, COMPARE_NO_SYNC);
        expect(state, dspic33_device_advance(cpu, 4u),
               "advance before coincident OC compare and synchronization");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(capture_base + 2u)) & 0x0040u) == 0u,
               "coincident OC synchronization does not occur at compare value");
        expect(state, dspic33_device_advance(cpu, 1u),
               "advance coincident OC compare and synchronization");
        expect(state,
               dspic33_read_word(cpu, 0x0908u) == 5u && output_is(cpu, 0u, false) &&
                   (dspic33_read_word(cpu, (uint16_t)(capture_base + 2u)) & 0x0040u) !=
                       0u,
               "coincident primary match retains free-running synchronization");
        expect(state, dspic33_device_advance(cpu, 1u),
               "advance coincident OC output pipeline");
        expect(state, output_is(cpu, 0u, mode != 6u),
               "coincident primary match preserves documented output timing");
    }

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, capture_base, 0u);
    dspic33_write_word(cpu, (uint16_t)(capture_base + 2u), 0x0081u);
    dspic33_write_word(cpu, capture_base, 0x1c03u);
    configure_compare_mode(cpu, 0u, 5u, 4u, 2u, COMPARE_NO_SYNC);
    expect(state, dspic33_device_advance(cpu, 5u),
           "advance free-running OC to first synchronization output");
    expect(state,
           (dspic33_read_word(cpu, (uint16_t)(capture_base + 2u)) & 0x0040u) != 0u,
           "free-running OC emits first synchronization output");
    dspic33_write_word(cpu, (uint16_t)(capture_base + 2u), 0x0081u);
    dspic33_write_word(cpu, 0x0904u, 8u);
    expect(state, dspic33_device_advance(cpu, 3u),
           "advance before rewritten secondary synchronization");
    expect(state,
           dspic33_read_word(cpu, 0x0908u) == 8u &&
               (dspic33_read_word(cpu, (uint16_t)(capture_base + 2u)) & 0x0040u) == 0u,
           "rewritten secondary compare waits for its following clock");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance rewritten secondary synchronization output");
    expect(state,
           dspic33_read_word(cpu, 0x0908u) == 9u &&
               (dspic33_read_word(cpu, (uint16_t)(capture_base + 2u)) & 0x0040u) != 0u,
           "later secondary rewrite emits another synchronization before rollover");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, capture_base, 0u);
    dspic33_write_word(cpu, (uint16_t)(capture_base + 2u), 0x0081u);
    dspic33_write_word(cpu, capture_base, 0x1c03u);
    configure_compare_mode(cpu, 0u, 6u, UINT16_MAX, 2u, COMPARE_NO_SYNC);
    expect(state, dspic33_device_advance(cpu, UINT16_MAX),
           "advance free-running OC to maximum secondary compare");
    expect(state,
           dspic33_read_word(cpu, 0x0908u) == UINT16_MAX &&
               (dspic33_read_word(cpu, (uint16_t)(capture_base + 2u)) & 0x0040u) == 0u,
           "maximum secondary compare precedes synchronization output");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance maximum secondary compare through rollover");
    expect(state,
           dspic33_read_word(cpu, 0x0908u) == 0u &&
               (dspic33_read_word(cpu, (uint16_t)(capture_base + 2u)) & 0x0040u) != 0u,
           "maximum secondary compare synchronizes on rollover without duplication");
}

static void lifecycle_cases(OutputCompareConformance* state, Dspic33* cpu) {
    Dspic33 copy;
    bool initialized = dspic33_initialize(&copy);
    bool high;
    expect(state, initialized, "initialize OC copy");
    if (!initialized) {
        return;
    }

    dspic33_reset(cpu, 0u);
    configure_compare(cpu, 0u, 4u, 2u);
    expect(state, dspic33_device_advance(cpu, 1u), "advance OC before copy");
    expect(state, dspic33_copy(&copy, cpu), "copy pending OC state");
    expect(state, dspic33_device_advance(cpu, 1u) && dspic33_device_advance(&copy, 1u),
           "advance original and copied OC");
    expect(state,
           output_is(cpu, 0u, false) && output_is(&copy, 0u, false) &&
               dspic33_read_word(cpu, 0x0908u) == dspic33_read_word(&copy, 0x0908u),
           "copy preserves OC event and state");

    dspic33_reset(cpu, 0u);
    configure_compare_mode(cpu, 0u, 1u, 4u, 2u, COMPARE_SELF_SYNC);
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance delayed OC output before copy");
    expect(state,
           output_is(cpu, 0u, false) && !interrupt_flag(cpu, 0u) &&
               cpu->io.output_compare.phase[0] == 2u && dspic33_copy(&copy, cpu),
           "copy delayed OC pipeline state");
    expect(state, dspic33_device_advance(cpu, 1u) && dspic33_device_advance(&copy, 1u),
           "advance copied delayed OC output");
    expect(state,
           output_is(cpu, 0u, true) && output_is(&copy, 0u, true) &&
               !interrupt_flag(cpu, 0u) && !interrupt_flag(&copy, 0u),
           "copy preserves delayed OC output event");
    expect(state, dspic33_device_advance(cpu, 2u) && dspic33_device_advance(&copy, 2u),
           "advance copied delayed OC interrupt");
    expect(state,
           interrupt_flag(cpu, 0u) && interrupt_flag(&copy, 0u) &&
               dspic33_read_word(cpu, 0x0908u) == dspic33_read_word(&copy, 0x0908u),
           "copy preserves delayed OC interrupt event");

    dspic33_reset(cpu, 0u);
    configure_compare_mode(cpu, 0u, 1u, 4u, 2u, COMPARE_SELF_SYNC);
    expect(state, dspic33_device_advance(cpu, 2u), "advance delayed OC before disable");
    dspic33_write_word(cpu, 0x0900u, 0u);
    expect(state, dspic33_device_advance(cpu, 3u),
           "advance disabled delayed OC events");
    expect(state,
           !dspic33_output_compare_output(cpu, 0u, &high) && !interrupt_flag(cpu, 0u) &&
               cpu->events.count == 0u,
           "disable cancels delayed OC output and interrupt");

    dspic33_reset(cpu, 0u);
    configure_compare_mode(cpu, 0u, 1u, 4u, 2u, COMPARE_SELF_SYNC);
    expect(state, dspic33_device_advance(cpu, 2u), "advance delayed OC before restart");
    dspic33_write_byte(cpu, 0x0900u, 2u);
    expect(state,
           output_is(cpu, 0u, true) && cpu->io.output_compare.phase[0] == 0u &&
               dspic33_read_word(cpu, 0x0908u) == 0u,
           "mode change restarts delayed OC pipeline");
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance restarted OC through stale events");
    expect(state,
           output_is(cpu, 0u, true) && !interrupt_flag(cpu, 0u) &&
               cpu->io.output_compare.phase[0] == 2u,
           "stale delayed events cannot alter restarted OC");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance restarted OC output pipeline");
    expect(state, output_is(cpu, 0u, false) && !interrupt_flag(cpu, 0u),
           "restarted OC uses only its new delayed output");

    dspic33_reset(cpu, 0u);
    configure_compare_mode(cpu, 0u, 1u, 4u, 2u, COMPARE_SELF_SYNC);
    expect(state, dspic33_device_advance(cpu, 2u), "advance delayed OC before reset");
    dspic33_reset(cpu, 0u);
    expect(state, dspic33_device_advance(cpu, 3u), "advance reset delayed OC events");
    expect(state,
           !dspic33_output_compare_output(cpu, 0u, &high) &&
               cpu->io.output_compare.output_high == 0u &&
               cpu->io.output_compare.phase[0] == 0u && cpu->events.count == 0u &&
               !interrupt_flag(cpu, 0u),
           "reset cancels delayed OC output and interrupt");

    dspic33_reset(cpu, 0u);
    configure_compare(cpu, 0u, 4u, 2u);
    dspic33_write_word(cpu, 0x0900u, 0u);
    expect(state, dspic33_device_advance(cpu, 6u), "advance disabled stale OC events");
    expect(state,
           !dspic33_output_compare_output(cpu, 0u, &high) &&
               dspic33_read_word(cpu, 0x0908u) == 0u && !interrupt_flag(cpu, 0u),
           "disable cancels OC events and output");

    dspic33_reset(cpu, 0u);
    configure_compare(cpu, 0u, 4u, 2u);
    dspic33_write_word(cpu, 0x0900u, 0u);
    configure_compare(cpu, 0u, 6u, 3u);
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance re-enabled OC across stale event");
    expect(state,
           output_is(cpu, 0u, true) && dspic33_read_word(cpu, 0x0908u) == 2u &&
               !interrupt_flag(cpu, 0u),
           "stale generation cannot alter re-enabled OC");
    expect(state, dspic33_device_advance(cpu, 1u), "advance re-enabled OC duty event");
    expect(state,
           output_is(cpu, 0u, false) && dspic33_read_word(cpu, 0x0908u) == 3u &&
               !interrupt_flag(cpu, 0u),
           "re-enabled OC follows new duty schedule");
    expect(state, dspic33_device_advance(cpu, 2u), "advance across stale period event");
    expect(state,
           output_is(cpu, 0u, false) && dspic33_read_word(cpu, 0x0908u) == 5u &&
               !interrupt_flag(cpu, 0u),
           "stale period cannot reset re-enabled OC");
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance re-enabled OC period event");
    expect(state,
           output_is(cpu, 0u, true) && dspic33_read_word(cpu, 0x0908u) == 0u &&
               interrupt_flag(cpu, 0u),
           "re-enabled OC follows new period schedule");

    dspic33_reset(cpu, 0u);
    configure_compare(cpu, 0u, 4u, 2u);
    dspic33_reset(cpu, 0u);
    expect(state, dspic33_device_advance(cpu, 6u), "advance reset OC queue");
    expect(state,
           !dspic33_output_compare_output(cpu, 0u, &high) &&
               cpu->io.output_compare.output_high == 0u && cpu->events.count == 0u,
           "reset clears OC state and events");

    expect(state, !dspic33_output_compare_output(cpu, 16u, &high),
           "reject invalid OC channel");
    expect(state, !dspic33_output_compare_output(cpu, 0u, NULL),
           "reject null OC output destination");
    expect(state, !dspic33_output_compare_pin(cpu, 0u, &high),
           "reject unmapped OC pin");

    dspic33_reset(cpu, 0u);
    cpu->device_cycles = UINT64_MAX;
    configure_compare(cpu, 0u, 4u, 2u);
    expect(state,
           cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR &&
               (dspic33_read_word(cpu, 0x0900u) & 7u) == 0u &&
               dspic33_read_word(cpu, 0x0908u) == 0u &&
               !dspic33_output_compare_output(cpu, 0u, &high) &&
               cpu->events.count == 0u,
           "initial OC schedule failure aborts channel");

    dspic33_reset(cpu, 0u);
    cpu->device_cycles = UINT64_MAX - 2u;
    configure_compare(cpu, 0u, 4u, 2u);
    expect(state, !dspic33_device_advance(cpu, 2u),
           "OC reschedule overflow stops advance");
    expect(state,
           cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR &&
               (dspic33_read_word(cpu, 0x0900u) & 7u) == 0u &&
               dspic33_read_word(cpu, 0x0908u) == 0u &&
               !dspic33_output_compare_output(cpu, 0u, &high) &&
               cpu->events.count == 0u,
           "OC reschedule failure aborts channel");

    dspic33_reset(cpu, 0u);
    cpu->device_cycles = UINT64_MAX - 3u;
    configure_compare_mode(cpu, 0u, 1u, 4u, 1u, COMPARE_SELF_SYNC);
    expect(state, !dspic33_device_advance(cpu, 1u),
           "delayed OC interrupt overflow stops advance");
    expect(state,
           cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR &&
               (dspic33_read_word(cpu, 0x0900u) & 7u) == 0u &&
               dspic33_read_word(cpu, 0x0908u) == 0u &&
               cpu->io.output_compare.phase[0] == 0u &&
               !dspic33_output_compare_output(cpu, 0u, &high) &&
               cpu->events.count == 0u && !interrupt_flag(cpu, 0u),
           "delayed OC schedule failure aborts the pipeline");
    dspic33_destroy(&copy);
}

int main(void) {
    Dspic33 cpu;
    OutputCompareConformance state = {0u, 0u, 0u};
    bool initialized = dspic33_initialize(&cpu);
    expect(&state, initialized, "initialize output compare processor");
    if (initialized) {
        access_cases(&state, &cpu);
        waveform_cases(&state, &cpu);
        boundary_cases(&state, &cpu);
        buffering_cases(&state, &cpu);
        free_running_cases(&state, &cpu);
        instruction_transition_cases(&state, &cpu);
        free_running_buffer_cases(&state, &cpu);
        pps_cases(&state, &cpu);
        interrupt_cases(&state, &cpu);
        single_compare_cases(&state, &cpu);
        dual_compare_cases(&state, &cpu);
        center_aligned_cases(&state, &cpu);
        immediate_compare_write_cases(&state, &cpu);
        output_control_cases(&state, &cpu);
        channel_mode_matrix_cases(&state, &cpu);
        one_shot_restart_cases(&state, &cpu);
        unsupported_cases(&state, &cpu);
        power_state_cases(&state, &cpu);
        pmd_channel_cases(&state, &cpu);
        pmd_lifecycle_cases(&state, &cpu);
        alternate_clock_cases(&state, &cpu);
        trigger_source_cases(&state, &cpu);
        trigger_one_shot_cases(&state, &cpu);
        synchronization_source_cases(&state, &cpu);
        alternate_clock_batch_cases(&state, &cpu);
        timer_clock_synchronization_cases(&state, &cpu);
        cross_timer_source_ordering_cases(&state, &cpu);
        synchronization_control_cases(&state, &cpu);
        alternate_clock_control_cases(&state, &cpu);
        alternate_instruction_activation_cases(&state, &cpu);
        trigger_instruction_transition_cases(&state, &cpu);
        synchronization_lifecycle_cases(&state, &cpu);
        channel_trigger_matrix_cases(&state, &cpu);
        trigger_source_negative_cases(&state, &cpu);
        coexistence_cases(&state, &cpu);
        lifecycle_cases(&state, &cpu);
        dspic33_destroy(&cpu);
    }
    printf("[output-compare-summary] cases=%u passed=%u failed=%u\n", state.cases,
           state.passed, state.failed);
    return state.failed == 0u ? 0 : 1;
}
